<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link href="../js/mihoja.css" rel="stylesheet" type="text/css" />
<title>Soy el Frame 1</title>
</head>
<body >

<!--  ----------------------------------para JSP---------------------------------------- -->
<h1>JSP </h1>
<h2>¿Qu&eacute; es? </h2> 
<p> JavaServer Pages (JSP) es una tecnolog&iacute;a que ayuda a los desarrolladores de software a crear p&aacute;ginas web din&aacute;micas basadas en HTML, XML, entre otros tipos de documentos. JSP es similar a PHP, pero usa el lenguaje de programaci&oacute;n Java.  </br>
Para desplegar y correr JavaServer Pages, se requiere un servidor web compatible con contenedores servlet como Apache Tomcat o Jetty.  </br>
El rendimiento de una p&aacute;gina JSP es el mismo que tendr&iacute;a el servlet equivalente, ya que el c&oacute;digo es compilado como cualquier otra clase Java. A su vez, la m&aacute;quina virtual compilar&aacute; din&aacute;micamente a c&oacute;digo de m&aacute;quina las partes de la aplicaci&oacute;n que lo requieran. Esto hace que JSP tenga un buen desempeño y sea m&aacute;s eficiente que otras tecnolog&iacute;as web que ejecutan el c&oacute;digo de una manera puramente interpretada.  </br>
La principal ventaja de JSP frente a otros lenguajes es que el lenguaje Java es un lenguaje de prop&oacute;sito general que excede el mundo web y que es apto para crear clases que manejen l&oacute;gica de negocio y acceso a datos de una manera prolija. Esto permite separar en niveles las aplicaciones web, dejando la parte encargada de generar el documento HTML en el archivo JSP. </br>
Otra ventaja es que JSP hereda la portabilidad de Java, y es posible ejecutar las aplicaciones en m&uacute;ltiples plataformas sin cambios. Es com&uacute;n incluso que los desarrolladores trabajen en una plataforma y que la aplicaci&oacute;n termine siendo ejecutada en otra.

</p> 

<h2>ejemplos </h2>
<p>A continuaci&oacute;n se presenta el famoso “hola mundo” en este lenguaje.</p> </br> </br>
<pre id="codigo">

&lthtml></br>
 &lthead></br>
  &lttitle>Mi titulo</title></br>
 &lt/head></br>
 &ltbody></br>
  <%out.println("Hola Mundo en JSP");%></br>
 &lt/body></br>
&lt/html></br>


</pre>

<p>Si deseas m&aacute;s informaci&oacute;n consulta los siguientes sitios:</p>
<a href="http://www.programacionfacil.com/java_jsp/start">http://www.programacionfacil.com/java_jsp/start</a> </br>
<a href="www.youtube.com/watch?v=ogdmEOLBjKc?">www.youtube.com/watch?v=ogdmEOLBjKc?</a> </br>
<a href="http://www.programacionfacil.com/programacion/manual_java_jsp">http://www.programacionfacil.com/programacion/manual_java_jsp</a> </br>


</body>
</html>
